app/controllers/favorites_controller.rb

  def create
    @movie.favorites.create!(user: current_user)
---
INSERT INTO "favorites" ("created_at", "movie_id", "updated_at", "user_id") VALUES (?, ?, ?, ?)  [["created_at", "2015-08-10 19:00:41.931565"], ["movie_id", 1], ["updated_at", "2015-08-10 19:00:41.931565"], ["user_id", 7]]

  def destroy
    fave = current_user.favorites.find(params[:id])
    fave.destroy
---
SELECT  "favorites".* FROM "favorites"  WHERE "favorites"."user_id" = ? AND "favorites"."id" = ? LIMIT 1  [["user_id", 7], ["id", 4]]
DELETE FROM "favorites" WHERE "favorites"."id" = ?  [["id", 4]]