app/controllers/movies_controller.rb

  def show
    @fans = @movie.fans
    @genres = @movie.genres

    if current_user
      @current_fave = current_user.favorites.find_by(movie_id: @movie.id)
---
SELECT  "favorites".* FROM "favorites"  WHERE "favorites"."user_id" = ? AND "favorites"."movie_id" = 1 LIMIT 1  [["user_id", 7]]
SELECT "genres".* FROM "genres" INNER JOIN "characterizations" ON "genres"."id" = "characterizations"."genre_id" WHERE "characterizations"."movie_id" = ?  [["movie_id", 1]]

  def set_movie
    @movie = Movie.find_by!(slug: params[:id])
---
SELECT  "movies".* FROM "movies"  WHERE "movies"."slug" = 'catwoman' LIMIT 1