app/controllers/reviews_controller.rb

INSERT INTO "reviews" ("comment", "created_at", "movie_id", "stars", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?)  [["comment", "Awesome!"], ["created_at", "2015-08-10 15:52:25.298136"], ["movie_id", 5], ["stars", 5], ["updated_at", "2015-08-10 15:52:25.298136"], ["user_id", 1]]
---
  def create
    @review = @movie.reviews.new(review_params)
    @review.user = current_user
    if @review.save